### Вычисления с помощью Numpy

#### Задание 1

In [ ]:
import numpy as np

In [ ]:
a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]])

In [ ]:
a

In [ ]:
mean_a = a.mean(axis=1)

In [ ]:
mean_a

#### Задание 2

In [ ]:
a_centered = np.array([[x - mean_a[0] for x in a[0]], [x - mean_a[1] for x in a[1]]])

In [ ]:
a_centered

In [ ]:
a_centered_sp = a_centered[0] @ a_centered[1]

In [ ]:
a_centered_sp

In [ ]:
a_centered_sp/(a.ndim - 1)

#### Задание 4**

In [ ]:
?np.cov

In [ ]:
a.T

In [ ]:
cov = np.cov(a.T)

In [ ]:
a_centered_sp = np.cov(a.T)[0,1]

In [ ]:
a_centered_sp

### Работа с данными в Pandas

#### Задание 1

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']})

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

#### Задание 2

In [4]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]})

In [5]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [6]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'right')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3

In [ ]:
top5 = pd.DataFrame({'author_id':[authors_price['author_id']]})

In [20]:
top5 = authors_price.nlargest(5, 'price')

In [21]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [22]:
ss = authors_price.nlargest(5, 'price')['author_id']

In [23]:
type(ss)

pandas.core.series.Series

In [26]:
top5 = pd.DataFrame(authors_price.nlargest(5, 'price')['author_id'])

In [27]:
top5

   author_id
3          2
0          1
4          2
5          3
2          1

In [28]:
authors_price.groupby('author_name')['price'].max()

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [29]:
authors_price.groupby('author_name')['price'].min()

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [40]:
type(authors_price.groupby('author_name')['price'].min())

pandas.core.series.Series

#### Задание 4

In [61]:
authors_stat = pd.DataFrame({
                             'min_price':authors_price.groupby('author_name')['price'].min(), 
                             'max_price':authors_price.groupby('author_name')['price'].max(),
                             'mean_price':authors_price.groupby('author_name')['price'].mean()
                            }).reset_index()

In [62]:
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

#### Задание 5**

In [67]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [68]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [96]:
?pd.pivot_table

In [95]:
book_info = authors_price.pivot_table('price', index='author_name', columns='cover', fill_value=0 )

In [88]:
book_info

cover        мягкая  твердая
author_name
Островский      330        0
Тургенев        325      450
Чехов             0      475

In [89]:
book_info.to_pickle('book_info.pkl')

In [90]:
book_info2 = pd.read_pickle('book_info.pkl')

In [91]:
book_info2

cover        мягкая  твердая
author_name
Островский      330        0
Тургенев        325      450
Чехов             0      475

In [92]:
pd.merge(book_info, book_info2)

cover  мягкая  твердая
0         330        0
1         325      450
2           0      475